Revit 2026 API

# TaskDialog Constructor

---

Creates a task dialog with title.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TaskDialog(
	string title
)
```
```vb
Public Sub New (
	title As String
)
```
```cpp
public:
TaskDialog(
	String^ title
)
```
```fsharp
new :
        title : string -> TaskDialog
```

#### Parameters

title String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when title is . |
| ArgumentException | Thrown when title is an empty string. |

#### Reference

TaskDialog Class

Autodesk.Revit.UI Namespace